# Operações no Pandas

In [2]:
import pandas as pd

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4], 
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
#analisa coluna e retorna o tipo de dados que é a coluna do dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [11]:
#verifica tamanho das colunas
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

## valores unicos do dataframe

In [12]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [14]:
#quantos valores unicos existem
df["col2"].nunique()

3

In [18]:
#contagem de cada um dos elementos unicos 
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## funções

In [21]:
def comp (x):
    return x ** 2 + 3

In [24]:
df["col1"].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [25]:
#como eu posso adicionar uma nova coluna para esse resultado do apply?
df["col1_cal"] = df["col1"].apply(comp)

In [26]:
df

   col1  col2 col3  col1_cal
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [28]:
#substituindo a função def por lambda
df["col1"].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

## operações

In [32]:
#soma
df["col1"].sum()

10

In [33]:
#media
df["col1"].mean()

2.5

In [35]:
#multiplica - sequência
df["col1"].product()

24

In [36]:
#desvio padrão
df["col1"].std()

1.2909944487358056

In [37]:
#max
df["col1"].max()

4

In [39]:
#min
df["col1"].min()

1

In [41]:
#indice com valor maximo
df["col1"].idxmax()

3

In [42]:
df

   col1  col2 col3  col1_cal
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [45]:
#combinações, ex: somatoria da coluna sempre 1 sempre que o valor da coluna 2 for igual a 444
df[df["col2"] == 444]

   col1  col2 col3  col1_cal
0     1   444  abc         4
3     4   444  xyz        19

In [46]:
df[df["col2"] == 444]["col1"].sum()

5

In [49]:
#ordenar
df.sort_values(by="col2")

   col1  col2 col3  col1_cal
0     1   444  abc         4
3     4   444  xyz        19
1     2   555  def         7
2     3   666  ghi        12

In [4]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [5]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## map, dict_map

In [8]:
#criação de colunas condicionais, toda vez que ele tiver one na coluna ele traz 1 e se tiver two ele traz 2...
dict_map = {"one":"1", "two":"2"}

In [9]:
df["E"] = df["B"].map(dict_map)

In [10]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

## pivot table

In [11]:
df.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

## dados temporais | Datas

In [14]:
numero_de_dias = 100

In [15]:
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)

In [16]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df = pd.DataFrame(range(numero_de_dias), columns=["number"], index=datas)
df

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [22]:
df.index[0].day

1

In [23]:
df.index[0].month

1

In [24]:
df.index[0].year

2021

In [26]:
df.index[0].hour

0

In [28]:
#pouxando somente mês 1
df[df.index.month==1]

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
2021-01-06       5
2021-01-07       6
2021-01-08       7
2021-01-09       8
2021-01-10       9
2021-01-11      10
2021-01-12      11
2021-01-13      12
2021-01-14      13
2021-01-15      14
2021-01-16      15
2021-01-17      16
2021-01-18      17
2021-01-19      18
2021-01-20      19
2021-01-21      20
2021-01-22      21
2021-01-23      22
2021-01-24      23
2021-01-25      24
2021-01-26      25
2021-01-27      26
2021-01-28      27
2021-01-29      28
2021-01-30      29
2021-01-31      30

In [30]:
df[df.index.day==10]

            number
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [31]:
df["month"] = df.index.month

In [32]:
df

            number  month
2021-01-01       0      1
2021-01-02       1      1
2021-01-03       2      1
2021-01-04       3      1
2021-01-05       4      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[100 rows x 2 columns]

In [33]:
import datetime

In [35]:
df[df.index > datetime.datetime(2021,1,10)]

            number  month
2021-01-11      10      1
2021-01-12      11      1
2021-01-13      12      1
2021-01-14      13      1
2021-01-15      14      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[90 rows x 2 columns]

In [36]:
df.index[19].day

20